# Reading and Writing Data in Text Format

In [62]:
import csv

In [63]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
import pandas as pd
df = pd.read_csv('ex1.csv')

In [7]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
pd.read_table('ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [67]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [69]:
pd.read_csv('ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [70]:
pd.read_csv('ex2.csv', names = ['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
names = ['a', 'b', 'c', 'd', 'message']

In [71]:
pd.read_csv('ex2.csv', names = names , index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [64]:
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,12,14
two,d,15,16

In [20]:
parsed = pd.read_csv('csv_mindex.csv', index_col = ['key1', 'key2'])

In [21]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         12      14
     d         15      16

In [65]:
!type ex3.txt

    A  B  C
aaa 45 52 63
bbb 12 13 14
ccc 75 58 95
ddd 47 89 63

In [29]:
list(open('ex3.txt'))

['    A  B  C\n',
 'aaa 45 52 63\n',
 'bbb 12 13 14\n',
 'ccc 75 58 95\n',
 'ddd 47 89 63']

In [30]:
result = pd.read_table('ex3.txt')

In [31]:
result

        A  B  C
0  aaa 45 52 63
1  bbb 12 13 14
2  ccc 75 58 95
3  ddd 47 89 63

In [33]:
result = pd.read_table('ex3.txt', sep = '\s+')
result

      A   B   C
aaa  45  52  63
bbb  12  13  14
ccc  75  58  95
ddd  47  89  63

In [72]:
!type ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads csv files with computers, anyway
1,2,3,4,hello ROZINA
5,6,7,8,world
9,10,11,12,foo

In [74]:
pd.read_csv('ex4.csv', skiprows = [0,2,3])

   a   b   c   d       message
0  1   2   3   4  hello ROZINA
1  5   6   7   8         world
2  9  10  11  12           foo

In [75]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,3,10,11,12,foo

In [76]:
result5 = pd.read_csv('ex5.csv')
result5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  3  10  11.0  12     foo

In [45]:
pd.isnull(result5)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [47]:
result6 = pd.read_csv('ex5.csv', na_values = ['NULL'])
result6

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  3  10  11.0  12     foo

In [53]:
sentinels = {'message': ['foo','NA'], 'something': ['two']}

In [54]:
pd.read_csv('ex5.csv', na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  3  10  11.0  12     NaN

In [82]:
pd.read_csv('rono.csv')

     Name  Age  Gender
0  Rozina   26  Female
1    John   30    Male
2  Rozain   46  Female

In [83]:
pd.read_csv('rono.csv', sep = '\s+')

    Name,Age,Gender
0  Rozina,26,Female
1      John,30,Male
2  Rozain,46,Female

In [84]:
pd.read_table('rono.csv')

    Name,Age,Gender
0  Rozina,26,Female
1      John,30,Male
2  Rozain,46,Female

In [96]:
pd.read_csv('rono.csv', header= None )

        0    1       2
0    Name  Age  Gender
1  Rozina   26  Female
2    John   30    Male
3  Rozain   46  Female

In [98]:
 pd.read_csv('rono.csv', header = None, skiprows = [0])

        0   1       2
0  Rozina  26  Female
1    John  30    Male
2  Rozain  46  Female

In [103]:
pd.read_csv('rono.csv', header = None,skiprows = [0], names = ['A','K','R'])

        A   K       R
0  Rozina  26  Female
1    John  30    Male
2  Rozain  46  Female

In [105]:
r = pd.read_csv('rono.csv')
r

     Name   Age  Gender
0  Rozina  26.0  Female
1    John  30.0    Male
2  Rozain  46.0  Female
3  Porsch   NaN    Male
4    Akon  66.0     NaN

In [112]:
pd.read_csv('rono.csv', na_values = {'Name': ['Rozain'], 'Gender': ['Female']})

     Name   Age Gender
0  Rozina  26.0    NaN
1    John  30.0   Male
2     NaN  46.0    NaN
3  Porsch   NaN   Male
4    Akon  66.0    NaN

In [118]:
pd.read_csv('rono.csv',index_col = ['Teams','sr.no'])

                 Name   Age  Gender
Teams sr.no
team1 1        Rozina  26.0  Female
      2          John  30.0    Male
      3        Rozain  46.0  Female
      4        Porsch   NaN    Male
      5          Akon  25.0     NaN
team2 1      Shahzain  32.0    Male
      2        Freddy  24.0    Male
      3         Marry  21.0  Female
      4         Wania  33.0  Female
      5         David  41.0    Male

In [141]:
f = pd.read_csv('rono.csv',index_col  = ['Teams', 'sr.no'],comment = '#')

In [142]:
f

                 Name   Age  Gender
Teams sr.no
team1 1        Rozina  26.0  Female
      2          John  30.0    Male
      3        Rozain  46.0  Female
      4        Porsch   NaN    Male
      5          Akon  25.0     NaN
team2 1      Shahzain  32.0    Male
      2        Freddy  24.0    Male
      3         Marry  21.0  Female
      4         Wania  33.0  Female
      5         David  41.0    Male

In [166]:
h = pd.read_csv('rono.csv', parse_dates = ['Date'], comment = '#', index_col = ['Teams','sr.no'])

C:\Users\Admin\AppData\Local\Temp\ipykernel_12764\169986439.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  h = pd.read_csv('rono.csv', parse_dates = ['Date'], comment = '#', index_col = ['Teams','sr.no'])

In [167]:
h

                  Date      Name   Age  Gender
Teams sr.no
team1 1     2024-01-29    Rozina  26.0  Female
      2     2024-04-01      John  30.0    Male
      3     2024-01-15    Rozain  46.0  Female
      4     2024-12-01    Porsch   NaN    Male
      5     2024-02-01      Akon  25.0     NaN
team2 1     2024-01-30  Shahzain  32.0    Male
      2     2024-01-18    Freddy  24.0    Male
      3     2024-01-25     Marry  21.0  Female
      4     2024-01-22     Wania  33.0  Female
      5     2024-10-01     David  41.0    Male

In [49]:
j = pd.read_csv('rono.csv', comment = '#', index_col = ['Teams', 'sr.no'], parse_dates = True)

In [50]:
j

                   Date      Name   Age  Gender
Teams sr.no
team1 1      29/01/2024    Rozina  26.0  Female
      2       4/01/2024      John  30.0    Male
      3      15/01/2024    Rozain  46.0  Female
      4      12/01/2024    Porsch   NaN    Male
      5       2/01/2024      Akon  25.0     NaN
team2 1      30/01/2024  Shahzain  32.0    Male
      2      18/01/2024    Freddy  24.0    Male
      3      25/01/2024     Marry  21.0  Female
      4      22/01/2024     Wania  33.0  Female
      5      10/01/2024     David  41.0    Male

In [50]:
import pandas as pd

k = pd.read_csv('rono.csv', keep_date_col = True, comment = '#',index_col= ['Teams', 'sr.no'],converters = None, 
               dayfirst =True)

In [51]:
k

                   Date      Name   Age  Gender
Teams sr.no
team1 1      29/01/2024    Rozina  26.0  Female
      2       4/01/2024      John  30.0    Male
      3      15/01/2024    Rozain  46.0  Female
      4      12/01/2024    Porsch   NaN    Male
      5       2/01/2024      Akon  25.0     NaN
team2 1      30/01/2024  Shahzain  32.0    Male
      2      18/01/2024    Freddy  24.0    Male
      3      25/01/2024     Marry  21.0  Female
      4      22/01/2024     Wania  33.0  Female
      5      10/01/2024     David  41.0    Male

In [52]:
k['Date']

Teams  sr.no
team1  1        29/01/2024
       2         4/01/2024
       3        15/01/2024
       4        12/01/2024
       5         2/01/2024
team2  1        30/01/2024
       2        18/01/2024
       3        25/01/2024
       4        22/01/2024
       5        10/01/2024
Name: Date, dtype: object

# Reading Text Files in Pieces

In [54]:
pd.options.display.max_rows = 10

In [62]:
import numpy as np
d = np.random.randn(10000,5)

In [63]:
h = pd.DataFrame(d, columns = ['one', 'two', 'three', 'four','key'])

In [64]:
h.head()

        one       two     three      four       key
0 -1.823241  1.146574  0.074176 -0.439424 -0.977360
1  0.302752 -0.369534 -0.133639 -2.590646  0.261318
2  1.432131  0.278002 -0.972441 -0.136501 -0.426499
3  0.235752  0.529215  1.357188 -1.342821 -0.608572
4  2.137822  0.883518 -0.464421 -1.004523  0.040499

In [121]:
h.to_csv('h.csv', sep=',', index=False, encoding='utf-8')

In [123]:
h.shape

(10000, 5)

In [124]:
h

           one       two     three      four       key
0     1.395313  0.861424  1.274158  1.014656  1.074541
1     0.345466 -1.490775 -0.890013 -0.322653  0.208028
2    -0.345828 -0.765514  1.048524  0.275057 -0.706844
3    -0.427110  0.473759 -0.676504  0.206054  0.956062
4    -0.050857 -0.198925  1.104871 -0.246922  0.875261
...        ...       ...       ...       ...       ...
9995 -0.717863 -1.056252  0.294680  0.194813  0.726460
9996 -0.453792 -0.865666  0.005903  0.861518  0.067913
9997 -1.894980  0.341786 -0.510047  1.094297 -0.707281
9998  0.153841 -0.310022 -1.209412  1.650772 -0.125665
9999 -1.486203 -1.144600 -1.429225 -1.592970  1.433516

[10000 rows x 5 columns]

In [125]:
result = pd.read_csv('h.csv')

In [126]:
result

           one       two     three      four       key
0     1.395313  0.861424  1.274158  1.014656  1.074541
1     0.345466 -1.490775 -0.890013 -0.322653  0.208028
2    -0.345828 -0.765514  1.048524  0.275057 -0.706844
3    -0.427110  0.473759 -0.676504  0.206054  0.956062
4    -0.050857 -0.198925  1.104871 -0.246922  0.875261
...        ...       ...       ...       ...       ...
9995 -0.717863 -1.056252  0.294680  0.194813  0.726460
9996 -0.453792 -0.865666  0.005903  0.861518  0.067913
9997 -1.894980  0.341786 -0.510047  1.094297 -0.707281
9998  0.153841 -0.310022 -1.209412  1.650772 -0.125665
9999 -1.486203 -1.144600 -1.429225 -1.592970  1.433516

[10000 rows x 5 columns]

In [127]:
pd.read_csv('h.csv', nrows =10)

        one       two     three      four       key
0  1.395313  0.861424  1.274158  1.014656  1.074541
1  0.345466 -1.490775 -0.890013 -0.322653  0.208028
2 -0.345828 -0.765514  1.048524  0.275057 -0.706844
3 -0.427110  0.473759 -0.676504  0.206054  0.956062
4 -0.050857 -0.198925  1.104871 -0.246922  0.875261
5 -0.186518 -1.722182  0.038741  0.705882  2.799410
6  1.885635 -0.612935 -0.255853 -1.752413 -0.867661
7  0.416807  0.780336 -1.589297  0.624623 -1.235381
8  0.163883 -0.615377 -0.668481 -0.571175 -0.050907
9 -0.474850  0.868472  2.834616  0.508536  1.641544

In [129]:
chunker = pd.read_csv('h.csv', chunksize = 1000)

In [130]:
chunker

In [144]:
chunker = pd.read_csv('h.csv', chunksize = 1000)

tot = pd.Series([], dtype = 'float64')
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value = 0)

In [145]:
tot = tot.sort_values(ascending = False)

In [152]:
tot[:]

-4.170463    1.0
 0.430370    1.0
 0.428454    1.0
 0.429319    1.0
 0.429501    1.0
            ...
-0.427925    1.0
-0.427767    1.0
-0.427478    1.0
-0.427389    1.0
 3.698181    1.0
Length: 10000, dtype: float64

# Writing Data to Text Format

In [153]:
data = pd.read_csv('ex5.csv')

In [154]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  3  10  11.0  12     foo

In [156]:
data.to_csv('mm.csv')

In [157]:
!type mm.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,3,10,11.0,12,foo

In [158]:
import sys

In [162]:
data.to_csv(sys.stdout, sep = '~')

~something~a~b~c~d~message
0~one~1~2~3.0~4~
1~two~5~6~~8~world
2~three~3~10~11.0~12~foo

In [163]:
data.to_csv(sys.stdout, sep = 'r')

rsomethingrarbrcrdrmessage
0roner1r2r3.0r4r
1rtwor5r6rr8r"world"
2r"three"r3r10r11.0r12rfoo

In [164]:
data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|3|10|11.0|12|foo

In [167]:
data.to_csv(sys.stdout, na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,3,10,11.0,12,foo

In [168]:
data.to_csv(sys.stdout, index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,3,10,11.0,12,foo

In [170]:
data.to_csv(sys.stdout, index = False,sep = '|', columns = ['a', 'b', 'c'])

a|b|c
1|2|3.0
5|6|
3|10|11.0

In [184]:
dates = pd.date_range('1/1/2000', periods = 7)

In [185]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [192]:
ts = pd.Series(np.arange(7), index = dates)

In [193]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [194]:
ts.to_csv('timeseries.csv')

In [196]:
!type timeseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

# Working with Delimited Formats

In [197]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [198]:
import csv

f = open('ex7.csv')

In [199]:
reader = csv.reader(f)

In [200]:
reader

In [201]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [202]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [203]:
header, values = lines[0], lines[1:]

In [204]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [205]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [223]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = "^"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [215]:
with open('ex7.csv','r') as f:
    reader = csv.reader(f, dialect = my_dialect)

In [224]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect = my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

# JSON Data

In [1]:
obj = """
{"name": "Wes",
 "place_lived": ["United States", "Spain","Germany"],
 "pet": null,
  "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
               {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}"""

In [2]:
import json

In [3]:
result = json.loads(obj)

In [4]:
result

{'name': 'Wes',
 'place_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [5]:
obj

'\n{"name": "Wes",\n "place_lived": ["United States", "Spain","Germany"],\n "pet": null,\n  "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},\n               {"name": "Katie", "age": 38,\n               "pets": ["Sixes", "Stache", "Cisco"]}]\n}'

In [6]:
asjson = json.dumps(result)

In [7]:
asjson

'{"name": "Wes", "place_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [8]:
import pandas as pd
siblings = pd.DataFrame(result['siblings'], columns = ['name', 'age'])

In [9]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [15]:
!type ex1.json

[{"a": 1, "b": 2, "c": 3},
{"a": 4, "b": 5, "c": 6},
{"a": 7, "b": 8, "c": 9}]

In [16]:
data = pd.read_json('ex1.json')

In [17]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [18]:
print(data.to_json()) # columns wise

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [21]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

# XML and HTML: Web Scraping

In [35]:
pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in c:\users\admin\rover\lib\site-packages (4.12.2)
Requirement already satisfied: html5lib in c:\users\admin\rover\lib\site-packages (1.1)
Requirement already satisfied: soupsieve>1.2 in c:\users\admin\rover\lib\site-packages (from beautifulsoup4) (2.4)
Requirement already satisfied: six>=1.9 in c:\users\admin\rover\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\admin\rover\lib\site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [6]:
pip install lxml

Requirement already satisfied: lxml in c:\users\admin\rover\lib\site-packages (4.9.2)
Note: you may need to restart the kernel to use updated packages.

In [10]:
import pandas as pd
tables = pd.read_html('https://www.fdic.gov/bank/individual/failed/index.html')

In [11]:
len(tables)

1

In [12]:
failures = tables[0]

In [13]:
failures.head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539

In [16]:
close_timestamps = pd.to_datetime(failures['Closing DateClosing'])

In [18]:
close_timestamps[5]

Timestamp('2020-10-23 00:00:00')

In [20]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2017      8
2015      8
2023      5
2016      5
2020      4
2004      4
2019      4
2001      4
2007      3
2003      3
2000      2
Name: Closing DateClosing, dtype: int64

# Parsing XML with lxml.objectify

In [3]:
from lxml import objectify

In [4]:
path = 'Performance_MNR.xml'

In [5]:
parsed = objectify.parse(open(path))

In [6]:
root = parsed.getroot()

In [7]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
              'DESIRED_CHANGE', 'DECIMAL_PALCES']

In [9]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [11]:
import pandas as pd
perf = pd.DataFrame(data)

In [12]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,12,Service Indicators,M,%,1,97.0,,97.0,

In [14]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [15]:
root

In [16]:
root.get('href')

'http://www.google.com'

In [17]:
root.text

'Google'

# Binary Data Formats

In [19]:
frame = pd.read_csv('ex1.csv')

In [20]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
frame.to_pickle('ex.pickle')

In [22]:
pd.read_pickle('ex.pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# Using HDF5 Format

In [24]:
import numpy as np
frame = pd.DataFrame({'a': np.random.randn(100)})

In [25]:
store = pd.HDFStore('mydata.h5')

In [26]:
store['obj1'] = frame

In [27]:
store['obj1_col']  = frame["a"]

In [28]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [29]:
store['obj1']

           a
0   0.287218
1   0.980862
2   1.219121
3  -0.918923
4   0.708044
..       ...
95  0.828071
96 -1.020464
97  0.509889
98 -1.125057
99 -0.889407

[100 rows x 1 columns]

In [30]:
store.put('obj2', frame, format = 'table')

In [31]:
store.select('obj2', where = ['index >= 10 and index <= 15'])

           a
10 -0.858443
11 -0.977615
12 -1.610765
13  0.005360
14 -1.637504
15 -0.778086

In [33]:
store.close()

In [34]:
frame.to_hdf('mydata.h5', 'obj3', format = 'table')

In [35]:
pd.read_hdf('mydata.h5', 'obj3', where = ['index < 5'])

          a
0  0.287218
1  0.980862
2  1.219121
3 -0.918923
4  0.708044

# Reading Microsoft Excel Files

In [42]:
pip install xlrd

Collecting xlrd
  Obtaining dependency information for xlrd from https://files.pythonhosted.org/packages/a6/0c/c2a72d51fe56e08a08acc85d13013558a2d793028ae7385448a6ccdfae64/xlrd-2.0.1-py2.py3-none-any.whl.metadata
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
   ---------------------------------------- 0.0/96.5 kB ? eta -:--:--
   ------------ --------------------------- 30.7/96.5 kB ? eta -:--:--
   ------------ --------------------------- 30.7/96.5 kB ? eta -:--:--
   -------------------------------------- - 92.2/96.5 kB 744.7 kB/s eta 0:00:01
   ---------------------------------------- 96.5/96.5 kB 549.6 kB/s eta 0:00:00
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1
Note: you may need to restart the kernel to use updated packages.

In [43]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\admin\rover\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\admin\rover\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [50]:
xlsx = pd.ExcelFile('Employee Sample Data.xlsx')

In [52]:
dfx = pd.read_excel(xlsx)

In [53]:
dfx.head()

,EEID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
0,E02387,Emily Davis,Sr. Manger,IT,Research & Development,Female,Black,55,2016-04-08,141604,0.15,United States,Seattle,2021-10-16
1,E04105,Theodore Dinh,Technical Architect,IT,Manufacturing,Male,Asian,59,1997-11-29,99975,0.00,China,Chongqing,NaT
2,E02572,Luna Sanders,Director,Finance,Speciality Products,Female,Caucasian,50,2006-10-26,163099,0.20,United States,Chicago,NaT
3,E02832,Penelope Jordan,Computer Systems Manager,IT,Manufacturing,Female,Caucasian,26,2019-09-27,84913,0.07,United States,Chicago,NaT
4,E01639,Austin Vo,Sr. Analyst,Finance,Manufacturing,Male,Asian,55,1995-11-20,95409,0.00,United States,Phoenix,NaT

In [54]:
dfx.shape

(1000, 14)

In [56]:
frame = pd.read_excel(xlsx)

In [58]:
frame.head()

,EEID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
0,E02387,Emily Davis,Sr. Manger,IT,Research & Development,Female,Black,55,2016-04-08,141604,0.15,United States,Seattle,2021-10-16
1,E04105,Theodore Dinh,Technical Architect,IT,Manufacturing,Male,Asian,59,1997-11-29,99975,0.00,China,Chongqing,NaT
2,E02572,Luna Sanders,Director,Finance,Speciality Products,Female,Caucasian,50,2006-10-26,163099,0.20,United States,Chicago,NaT
3,E02832,Penelope Jordan,Computer Systems Manager,IT,Manufacturing,Female,Caucasian,26,2019-09-27,84913,0.07,United States,Chicago,NaT
4,E01639,Austin Vo,Sr. Analyst,Finance,Manufacturing,Male,Asian,55,1995-11-20,95409,0.00,United States,Phoenix,NaT

In [60]:
writer = pd.ExcelWriter('ex2.xlsx')

In [66]:
h.to_excel(writer,'Sheet1')

In [70]:
writer.save()

C:\Users\Admin\AppData\Local\Temp\ipykernel_7972\934276808.py:1: FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
  writer.save()

In [71]:
frame.to_excel('ex2.xlsx')

# Interacting with Web APIs

In [72]:
import requests

In [73]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [74]:
resp = requests.get(url)

In [75]:
resp

In [76]:
data = resp.json()

In [80]:
data[1]['title']

'DEPR: enforce deprecation of non-standard argument to take'

In [81]:
data[0]['title']

'Add tests for transform sum with series'

In [82]:
data[29]['title']

'BUG: Fixed ADBC to_sql creation of table when using public schema'

In [84]:
issues = pd.DataFrame(data, columns = ['number', 'title',
                                       'labels','states'])

In [85]:
issues

,number,title,labels,states
0,58012,Add tests for transform sum with series,[],NaN
1,58011,DEPR: enforce deprecation of non-standard argu...,[],NaN
2,58010,DEPS: bump adbc-driver-postgresql min version ...,[],NaN
3,58009,DEPR: value_counts doing dtype inference on re...,[],NaN
4,58008,Backport PR #57553 on branch 2.2.x (API: avoid...,[],NaN
5,58007,API: Make `Series.array` a read-only EA,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",NaN
6,58006,CLN: remove unnecessary check `needs_i8_conver...,"[{'id': 1218227310, 'node_id': 'MDU6TGFiZWwxMj...",NaN
7,58005,DEPR: remove Tick.delta,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",NaN
8,58004,"DEPR: remove DTA.__init__, TDA.__init__","[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",NaN
9,58003,DEPR: enforce deprecation of DTI/TDI unused ke...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",NaN
10,58001,"BUG: Implement `fillna(..., limit=x)` for EAs","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",NaN
11,57999,DEPR: Enforce datetimelike deprecations,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",NaN
12,57998,CI: Enable pytables and numba in 312 build,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",NaN
13,57997,REF: Use numpy set methods in interpolate,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",NaN
14,57996,CLN: `pandas.concat` internal checks,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",NaN
15,57995,FIX #57645: Cannot use numpy FLS as indicies s...,[],NaN
16,57994,DOC: DataFrame.reset_index names param can't b...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",NaN
17,57993,BUG: Nones in pd.concat MultiIndex keys are no...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",NaN
18,57991,DOC: Fix reference to rows in `read_csv(index_...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",NaN
19,57990,"DOC: ecosystem.md: add pygwalker, add seaborn ...","[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",NaN
20,57989,BUG: CONTAINS_OP run on pd.NA results in pd.N...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",NaN
21,57988,PERF: (partial) fix for np_datetime.c performa...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",NaN
22,57987,DEPR: 'epoch' date format in to_json,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",NaN
23,57986,CLN: enforce deprecation of frequencies deprec...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",NaN
24,57985,BUG: Fix error for `boxplot` when using a pre-...,[],NaN
25,57984,Fix `to_timedelta` `np.int32` casting bug with...,[],NaN
26,57980,BUG: Unexpected Styler.format behavior,"[{'id': 1728592794, 'node_id': 'MDU6TGFiZWwxNz...",NaN
27,57979,ENH: Add leftsemi merge,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",NaN
28,57976,ENH: set __module__ for objects in pandas Scal...,"[{'id': 13101118, 'node_id': 'MDU6TGFiZWwxMzEw...",NaN
29,57974,BUG: Fixed ADBC to_sql creation of table when ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",NaN

In [86]:
issues.shape

(30, 4)

# Interacting with Databases

In [1]:
import sqlite3

In [2]:
query ="""CREATE TABLE test(a VARCHAR(20),
        b VARCHAR(20),
        c REAL,
        d INTEGER);"""

In [3]:
con = sqlite3.connect('mydata.sqlite')

In [4]:
con.execute(query)

In [5]:
con.commit()

In [6]:
data = [('Atlanta', 'Georgia', 1.25,6),
        ('Tallahassee', 'Florida', 2.6,3),
        ('Sacramento', 'California', 1.7,5)]

In [7]:
stmt = 'INSERT INTO test VALUES(?, ?, ?, ?)'

In [8]:
con.executemany(stmt, data)
con.commit()

In [9]:
con.commit()

In [10]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
print(type(rows), rows)

<class 'list'> [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]

In [11]:
rows = cursor.fetchall()

In [12]:
rows

[]

In [13]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [16]:
import pandas as pd
data_df = pd.DataFrame(rows, columns=[x[0] for x in cursor.description])
data_df

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [17]:
import sqlalchemy as sqla

In [18]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [21]:
data_df = pd.read_sql('select * from test', db)
print(data_df)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5